---
kind: property
id: P:Autodesk.Revit.DB.ViewOrientation3D.UpDirection
source: html/1353f55a-719d-75d2-a095-a70fbde71a4c.htm
---
# Autodesk.Revit.DB.ViewOrientation3D.UpDirection Property

The up direction vector

## Syntax (C#)
```csharp
public XYZ UpDirection { get; }
```